import React from "react";
import styles from "./AboutUs.module.css";

const AboutUs: React.FC = () => {
  return (
    <>
      <div className={styles.mainWrapper}>
        <div className={styles.contentWrapper}>
          <h1 className={styles.headerOfParagraph}>Про нас</h1>
          <p className={styles.content}>
            Celunea — молодий український бренд натуральної косметики, що
            виробляє повну лінійку доглядових засобів: від очищення до
            інтенсивного догляду. Наша основна ідея — поєднати давні народні
            знання про лікувальні та косметичні властивості українських трав з
            сучасними біотехнологіями і дизайном. Ми бачимо нішу на ринку:
            споживачі хочуть чисті, прозорі формули і красиву естетику — не
            тільки «крем», а ритуал догляду. Бренд пропонує продукти, що
            заспокоюють, відновлюють і підкреслюють природне сяйво шкіри.
          </p>
          <h1 className={styles.headerOfParagraph}>Місія</h1>
          <p className={styles.content}>
            Місія Celunea — дарувати гармонію й упевненість через натуральний
            догляд; робити якісну українську косметику доступною та привабливою.
            Ми працюємо на збереження здоров’я шкіри та природи: мінімізуємо
            шкідливі компоненти й пакуємо продукцію у перерабельні матеріали.
            Кожен продукт — це невеликий ритуал самообслуговування й відпочинку.
          </p>
          <h1 className={styles.headerOfParagraph}>Ціль</h1>
          <p className={styles.content}>
            Ціль компанії полягає не лише в тому, щоб забезпечити клієнтів
            якісними засобами для догляду та задовольнити їхні естетичні
            потреби, а й у тому, щоб сприяти покращенню їхнього емоційного стану
            та фізичного добробуту. Компанія прагне створювати продукти, які
            дарують не лише красу, а й гармонію, впевненість у собі та відчуття
            внутрішнього комфорту.
          </p>
          <h1 className={styles.headerOfParagraph}>Гарантії</h1>
          <p className={styles.content}>
            Вся косметика CELUNIA виготовляється виключно з сертифікованих
            компонентів, ефективність яких підтверджена міжнародною практикою, а
            також пройшла наш внутрішній вимогливий тест. Наші косметичні засоби
            сертифіковані в Україні та не тестуються на тваринах!
          </p>
          <br></br>
        </div>
      </div>
    </>
  );
};

export default AboutUs;
